# Getting Started

The biggest difference from NumPy is that pandas is designed for working with tabular or heterogeneous data. NumPy, by contrast, is best suited for working with homogeneous numerical array data.

In [1]:
# importing pandas and numpy
import numpy as np
import pandas as pd

In [2]:
# Series and DataFrame are also frequently used so import them as well
from pandas import Series, DataFrame

A Series is a one-dimensional array-like object containing a sequence of values and an associated array of data labels, called its index.

## pandas Data Structures

### Series

In [3]:
obj = pd.Series([4, 7, -5, 3])
obj #default index consisting of the integers 0 through N-1 is created

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3])

In [5]:
obj.index # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [6]:
# creating a Series with an index
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
obj2.values

array([ 4,  7, -5,  3])

In [9]:
obj2['d'] # accessing value at specified index

4

In [10]:
obj2['a'] = -6 # changing the value at an index
obj2

d    4
b    7
a   -6
c    3
dtype: int64

In [11]:
obj2[['c', 'a', 'd']] # getting values by specified sequence of indices

c    3
a   -6
d    4
dtype: int64

In [12]:
obj2[obj2 > 0] # getting values by specified condition

d    4
b    7
c    3
dtype: int64

In [13]:
obj2 * 2

d     8
b    14
a   -12
c     6
dtype: int64

In [14]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.002479
c      20.085537
dtype: float64

Another way to think about a Series is as a fixed-length, ordered dict, as it is a mapping of index values to data values. It can be used in many contexts where you might
use a dict

In [15]:
'b' in obj2

True

In [16]:
'e' in obj2

False

In [17]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
# when passing a dict, the index in the resulting Series will have the dict's keys in sorted order. This can be overridden by passing the dict keys in the order we want them to appear.
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
# the isnull and notnull functions in pandas should be used to detect missing data.
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [21]:
obj4.isnull() # instance method

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [22]:
obj3 + obj4 # pd.Series automatically aligns by index label

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [23]:
# Both the Series object itself and its index have a name attribute
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [24]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [25]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

DataFrame - 
It represents a rectangular table of data and contains an ordered collection of columns, each of which can be a different value type.
It has both a row and a column index.
it can be thought as a dict of Series all sharing the same index.

In [26]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [27]:
frame.head()# selects only the first five rows

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [28]:
# specify sequence of columns
pd.DataFrame(data, columns=['pop', 'state', 'year'])

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [29]:
# If you pass a column that isn't contained in the dict, it will appear with missing values in the result
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five', 'six'])                                                            
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [30]:
# retrieving a column in a DataFrame as a Series
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [31]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

frame2[column] works for any column name, but frame2.column only works when the column is a valid Python variable name.

In [32]:
# accessing rows using loc
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [33]:
# assigning values to a column
frame2['debt'] = 0 # assigning a scalar value
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     0
three  2002    Ohio  3.6     0
four   2001  Nevada  2.4     0
five   2002  Nevada  2.9     0
six    2003  Nevada  3.2     0

In [34]:
frame2['debt'] = np.arange(6.) # assigning an array of values
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [35]:
# When you are assigning lists or arrays to a column, the value’s length must match the length of the DataFrame
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [36]:
# Assigning a column that doesn’t exist will create a new column
frame2['eastern'] = frame2.state == 'Ohio'
frame2
# this cannot be done with frame2.eastern syntax

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [37]:
# deleting a column
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

The column returned from indexing a DataFrame is a view on the underlying data, not a copy.
Thus any in-place modifications to the Series will be reflected in the DataFrame.

The column can be explicitly copied with the Series's copy method

In [38]:
# for nested dicts, pandas interprets the outer dict keys as the columns and the inner keys as the row indices
pop = {'Nevada' : {2001: 2.4, 2002: 2.9},
      'Ohio' : {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [39]:
frame3=pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [40]:
# transposing (swapping rows and columns) the DataFrame
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [41]:
pdata = {'Ohio': frame3['Ohio'][:-1], 
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [42]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [43]:
frame3.values# returns data in the DataFrame as a two-dimensional ndarray

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [44]:
frame2.values # If the DataFrame's columns are different dtypes, the dtype of the values will be chosen to accomodate all the columns

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### Index Objects

pandas's Index objects are responsible for holding the axis labels and other metadata (like the axis name or names).

In [45]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [46]:
index[1:]

Index(['b', 'c'], dtype='object')

Index objects are immutable and thus can't be modified by the user, this makes it easy to share Index objects among data structures.

In [47]:
index[1] = 'd' # TypeError

TypeError: Index does not support mutable operations

In [48]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [49]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [50]:
obj2.index is labels

True

In addition to being array-like, an Index also behaves like a fixed-size set.

In [51]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [52]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [53]:
'Ohio' in frame3.columns

True

In [54]:
2003 in frame3.index

False

Unlike Python sets, a pandas Index can contain duplicate labels.

In [55]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels
# selections with duplicate labels will select all the occurences of that label

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## Essential Functionality

### Reindexing

In [56]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

Calling reindex on this Series rearranges the data according to the new index, introducing missing values if any index values were not already present.

In [57]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [58]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [59]:
# ffill - forward-fills the values, similarly bfill fills backward
obj3.reindex(range(8), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
6    yellow
7    yellow
dtype: object

With DataFrame, reindex can alter either the (row index, columns, or both. When passed only a sequence, it reindexes the rows in the result

In [60]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                    index = ['a','b','c'],
                    columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [61]:
frame2=frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [62]:
states=['Texas','Utah','California']
frame.reindex(columns=states) # reindexing column states

   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8

### Dropping Entries from an Axis

In [63]:
obj = pd.Series(np.arange(5.),index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [64]:
new_obj=obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [65]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [66]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [67]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),
                 index=['Ohio','Colorado','Utah','New York'],
                 columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [68]:
data.drop(['Colorado','Ohio'])
# calling drop with a sequence of labels will drop values from the row labels (axis 0)

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
# you can drop values from columns by passing axis=1 or axis='columns'
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [70]:
data.drop(['two','four'],axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [71]:
obj.drop('c',inplace=True)
obj
# with in-place, drop can manipulate an object without returning a new object.
# be careful with the inplace, as it destroys any data that is dropped

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### Indexing, Selection, and Filtering

In [72]:
obj=pd.Series(np.arange(4.),index=['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [73]:
obj['b']

1.0

In [74]:
obj[1]

1.0

In [75]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [76]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [77]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [78]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [79]:
# slicing with labels behaves differently than normal Python slicing in that the end-point is inclusive
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [80]:
# setting using these methods modifies the corresponding section of the Series
obj['b':'c']=5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [81]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),
                 index=['Ohio','Colorado','Utah','New York'],
                 columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [82]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [83]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [84]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [85]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [86]:
data<5 # boolean indexing

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [87]:
data[data<5]=0 
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### selecting with loc and iloc
They enable you to select a subset of the rows and columns from a DataFrame with Numpy-like notation using either axis labels (loc) or integers (iloc)

In [88]:
data.loc['Colorado',['two','three']] # Colorado['two'] and Colorado['three']

two      5
three    6
Name: Colorado, dtype: int64

In [89]:
data.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [90]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [91]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [92]:
# both indexing functions work with slices in addition to single labels or lists of labels
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [93]:
data.iloc[:,:3][data.three>5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Integer Indexes

In [94]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [95]:
ser[-1] # gives an error because what the user wants (label-based indexing or position based) is difficult

KeyError: -1

In [96]:
# On the other hand, with a non-integer inndex, there is no potential for ambiguity
ser2=pd.Series(np.arange(3.), index=['a','b','c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [97]:
ser2[-1]

2.0

To keep things consistent, if you have an axis index containing integers, data selection will always be label-oriented. For more precise handling, use loc (for labels) and iloc (for integers).

In [98]:
ser[:1]

0    0.0
dtype: float64

In [99]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [100]:
ser.iloc[:1]

0    0.0
dtype: float64

### Arithmetic and Data Alignment

In [101]:
s1=pd.Series([7.2,-2.5,3.4,1.5], index=['a','c','d','e'])

In [102]:
s2=pd.Series([-2.1,3.6,-1.5,4,3.1],
            index=['a','c','e','f','g'])

In [103]:
s1

a    7.2
c   -2.5
d    3.4
e    1.5
dtype: float64

In [104]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [105]:
s1+s2 # similar to an automatic outer join on index labels

a    5.1
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [106]:
# In the case of DataFrame, alignment is performes on both the rows and the columns
df1=pd.DataFrame(np.arange(9.).reshape(3,3), columns=list('bcd'),index=['Ohio','Texas','Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [107]:
df2=pd.DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
                index=['Utah','Ohio','Texas','Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [108]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [109]:
# If you add DataFrame objects with no row or column labels in common, the result will contain all nulls
df1=pd.DataFrame({'A':[1,2]})
df2=pd.DataFrame({'B':[3,4]})

In [110]:
df1

   A
0  1
1  2

In [111]:
df2

   B
0  3
1  4

In [112]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

### Arithmetic methods with fill values

In [113]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                    columns=list('abcd'))

In [114]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                    columns=list('abcde'))

In [115]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [116]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [117]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [118]:
# Using the add method to fill NA values
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [119]:
1/df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [120]:
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

Method            -     Description

add, radd        -  Methods for addition (+)

sub, rsub      -  Methods for subtraction (-)

div, rdiv      -   Methods for division (/)

floordiv, rfloordiv  -  Methods for floor division (//)
mul, rmul      -  Methods for multiplication (*)

pow, rpow     -  Methods for exponentiation (**)

In [121]:
# While reindexing a Series or a DataFrame, you can also specify a different fill value
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### Operations between DataFrame and Series

In [122]:
arr = np.arange(12.).reshape((3,4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [123]:
arr[0]

array([0., 1., 2., 3.])

In [124]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

When we subtract arr[0] from arr, the subtraction is performed once for each row.
This is referred to as broadcasting

In [127]:
frame=pd.DataFrame(np.arange(12.).reshape((4,3)),
                   columns=list('bde'),
                   index=['Utah','Ohio','Texas','Oregon'])

In [128]:
series=frame.iloc[0]

In [129]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [130]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

By default, arithmetic between DataFrame and Series matches the index of the Series
on the DataFrame’s columns, broadcasting down the rows:

In [131]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [132]:
series2=pd.Series(range(3), index=['b','e','f'])

In [133]:
series2

b    0
e    1
f    2
dtype: int64

In [134]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

If you want to instead broadcast over the columns, matching on the rows, you have to
use one of the arithmetic methods.

In [135]:
series3 = frame['d']

In [136]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [137]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [139]:
frame.sub(series3, axis='index')
# axis here is the axis to match on. In this case we mean to match on te DataFrame's row index(axis='index' or axis=0) and broadcast across.

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

## Function Application and mapping

In [5]:
frame=pd.DataFrame(np.random.randn(4, 3),
                   columns=list('bde'),
                   index=['Utah','Ohio','Texas','Oregon'])

In [6]:
frame

               b         d         e
Utah    1.090952  1.128278  1.221646
Ohio   -0.185264  0.523272 -1.588997
Texas  -1.125691  0.292612  1.081615
Oregon -0.709443 -1.265901 -1.071976

In [12]:
np.abs(frame) # gets the absolute value

               b         d         e
Utah    1.090952  1.128278  1.221646
Ohio    0.185264  0.523272  1.588997
Texas   1.125691  0.292612  1.081615
Oregon  0.709443  1.265901  1.071976

In [13]:
# DataFrame's apply method applies a function on one-dimensional arrays to each column or row.
f=lambda x: x.max() - x.min()
frame.apply(f)
# here the function f, which computes the difference between the maximum and minimum of a Series, is invoked once on each column in the frame.

b    2.216642
d    2.394179
e    2.810643
dtype: float64

In [10]:
# If you pass axis = 'columns' to apply, the function will be invoked once per row instead:
frame.apply(f, axis='columns')

Utah      0.130694
Ohio      2.112269
Texas     2.207306
Oregon    0.556458
dtype: float64

The function passed to apply need not return a scalar value; it can also return a Series
with multiple values:

In [14]:
def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])
frame.apply(f)

            b         d         e
min -1.125691 -1.265901 -1.588997
max  1.090952  1.128278  1.221646

Element-wise Python functions can be used, too. Suppose you wanted to compute a formatted string from each floating-point value in frame. You can  do this with applymap:

In [17]:
format=lambda x: '%.2f' % x
frame.applymap(format)
#The reason for the name applymap is that Series has a map method for applying an element-wise function:

            b      d      e
Utah     1.09   1.13   1.22
Ohio    -0.19   0.52  -1.59
Texas   -1.13   0.29   1.08
Oregon  -0.71  -1.27  -1.07

In [18]:
# Apply applies a function axis wise, while applymap applies a function element-wise.
frame['e'].map(format)

Utah       1.22
Ohio      -1.59
Texas      1.08
Oregon    -1.07
Name: e, dtype: object

## Sorting and Ranking

To sort lexicographically by row or column index, use the sort_index method, which returns a new, sorted object.

In [20]:
obj=pd.Series(range(4),index=['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [22]:
# With a DataFrame, you can sort by index on either axis:
frame=pd.DataFrame(np.arange(8).reshape((2, 4)), index=['three','one'],columns=['d','a','b','c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [23]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [24]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [25]:
# The data is sorted in ascending order by default, but can be sorted in descending order, too:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [26]:
# To sort a Series by its values, use sort_values method:
obj=pd.Series([4,7,-3,2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [27]:
# Any missing values are sorted to the end of the Series by default:
obj=pd.Series([4,np.nan,7,np.nan,-3,2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [28]:
# When sorting a DataFrame, you can use the data in one or more columns as the sort keys.To do so, pass one ormore column names to the by option of sort_values:
frame=pd.DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [29]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [31]:
frame.sort_values(by=['a','b'])
# To sort by multiple columns, pass a list of names:

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

Ranking assigns ranks from one through the number of valid data points in an array. By default rank breaks ties by assigning each group the mean rank:

In [34]:
obj=pd.Series([7,-5,7,4,2,0,4])
obj.rank()
# first occurance of 7 will have a rank 6 and 2nd one will have 7(assigning ranks in the order in which they're observed in the data) so mean 6.5 similarly for 4.

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

Ranks can also be assigned according to the order in which they’re observed in the
data:

In [35]:
obj.rank(method='first')
# Here, instead of using the average rank 6.5 for the entries 0 and 2, they instead have been set to 6 and 7 because label 0 precedes label 2 in the data.

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [37]:
# Ranking in descending order:
obj.rank(ascending=False, method='max')
# Assign tie values the maximum rank in the group

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [39]:
# DataFrame can compute ranks over the rows or the columns:
frame=pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [40]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [43]:
# Tie-breaking methods with rank


# METHOD                      DESCRIPTION

#'average'             Default: assign the average rank to each entry in the equal group
#'min'                 Use the minimum rank for the whole group
#'max'                 Use the maximum rank for the group
#'first'               Assign ranks in the order the values appear in the data
#'dense'               Like method-'min', but ranks always incraeas by 1 in bw groups rather than the number of equal elements in a group

## Axis Indices with Duplicate Labels

In [44]:
obj=pd.Series(range(5), index=['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [45]:
# is_unique property of index can tell you whether its labels are unique or not:
obj.index.is_unique

False

In [46]:
# Indexing a label with multiple entries returns a Series, while single entries return a scalar value:
obj['a']

a    0
a    1
dtype: int64

In [47]:
obj['c']

4

In [48]:
df=pd.DataFrame(np.random.randn(4,3),index=['a','a','b','b'])
df

          0         1         2
a -0.095521 -0.745501 -1.529872
a -0.748266 -1.417314 -1.796552
b -0.836185 -1.402743  2.368606
b -0.679584  0.835101 -0.164529

In [51]:
df.loc['b']

          0         1         2
b -0.836185 -1.402743  2.368606
b -0.679584  0.835101 -0.164529

## Summarizing and computing descriptive statistics

In [52]:
df=pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [53]:
df.sum() # returns a Series containing column sums

one    9.25
two   -5.80
dtype: float64

In [55]:
# passing axis='columns' or axis=1 sums across the columns instead
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

NA values are excluded unless the entire slice (row or column in this case) is NA.
This can be disabled with the skipna option:

In [57]:
df.mean(axis='columns',skipna=False)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [59]:
# idxmin, idxmax return indirect statistics like index calues where the minimum or maximum values are attained:
df.idxmax()

one    b
two    d
dtype: object

In [66]:
df.cumsum() # accumulation (Cummulative sum along an axis - 0 by default)

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [64]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [65]:
# on non-numeric data, describe produces alternative summary statistics:
obj=pd.Series(['a','a','b','c']*4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [68]:
# Method                         Description

#count                          Number of non-NA values
#describe                       Compute set of summary statistics for Series or each DataFrame column
#min, max                       Compute minimum and maximum values
#argmin, argmax                 Compute index locations (integers) at which minimum or maximum value obtained, respectively
#idxmin, idxmax                 Compute index labels at which minimum or maximum value obtained, respectively
#quantile                       Compute sample quantile ranging from 0 to 1
#sum                            Sum of values
#mean                           Mean of values
#median                         Arithmetic median (50% quantile) of values
#mad                            Mean absolute deviation from mean value
#prod                           Product of all values
#var                            Sample variance of values
#std                            Sample standard deviation of values
#skew                           Sample skewness (third moment) of values
#kurt                           Sample kurtosis (fourth moment) of values
#cumsum                         Cumulative sum of values
#cummin, cummax                 Cumulative minimum or maximum of values, respectively
#cumprod                        Cumulative product of values
#diff                           Compute first arithmetic difference (useful for time series)
#pct_change                     Compute percent changes

## Correlation and Covariance

## Unique values, value counts and membership

In [69]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [70]:
uniques=obj.unique() # gives you an array of the unique values in the Series:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [72]:
uniques.sort()
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [79]:
obj.value_counts() # computes a Series containing value frequencies:
# The Series is sorted by value in descending order as a convenience.

a    3
c    3
b    2
d    1
dtype: int64

In [78]:
pd.value_counts(obj.values,sort=False)

d    1
b    2
c    3
a    3
dtype: int64

isin performs a vectorized set membership check and can be useful in filtering a
dataset down to a subset of values in a Series or column in a DataFrame:

In [80]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [81]:
mask=obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [82]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

Related to isin is the Index.get_indexer method, which gives you an index array
from an array of possibly non-distinct values into another array of distinct values:

In [83]:
to_match=pd.Series(['c','a','b','b','c','a'])
unique_vals=pd.Series(['c','b','a'])
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In [85]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [87]:
result=data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Reading and Writing Data in Text Format

In [89]:
# Reading a csv file

# 1. df=pd.read_csv('<filepath>')
# Similarly
# 2. pd.read_table('<filepath>',sep=',')

# A file may not always have a header row.
# 3. pd.read_csv('<filepath>',header=None) - this assigns Default column names
# 4. pd.read_csv('<filepath>', names=['a', 'b', 'c', 'd', 'message']) - specifying names explicitly

# Suppose you wanted the message column to be the index of the returned DataFrame.
# You can either indicate you want the column at index 4 or named 'message' using the index_col argument:
# 5. names=['a','b','c','d','message']
# pd.read_csv('<filepath>',names=names,index_col='message')

# Data Cleaning and Preparation

## Handling Missing Data

In [2]:
string_data=pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

## Filtering out missing data

In [5]:
from numpy import nan as NA

In [6]:
data=pd.Series([1,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [8]:
data.dropna() # by defalut drops any row containing a missing value

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
# This is equivalent to:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3.]])

In [11]:
cleaned=data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [13]:
# Passing how='all' will only drop rows that are all NA:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
# To drop columns in the same way, pass axis=1 :
data[4]=NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(how='all',axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
df=pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0  2.091758       NaN       NaN
1 -0.027197       NaN       NaN
2  1.473916       NaN -0.145646
3 -2.633861       NaN  0.983841
4  0.322159  1.213468  1.272203
5 -0.152426 -0.642216  0.658181
6 -0.271299  1.226415  1.126141

In [17]:
df.dropna()

          0         1         2
4  0.322159  1.213468  1.272203
5 -0.152426 -0.642216  0.658181
6 -0.271299  1.226415  1.126141

In [18]:
# Suppose you want to keep only rows containing a certain number of observations. You can indicate this with the thresh argument:
df.dropna(thresh=2)

          0         1         2
2  1.473916       NaN -0.145646
3 -2.633861       NaN  0.983841
4  0.322159  1.213468  1.272203
5 -0.152426 -0.642216  0.658181
6 -0.271299  1.226415  1.126141

## Filling in missing data

In [19]:
# calling fillna with a constant replaces missing values with that value:
df.fillna(0)

          0         1         2
0  2.091758  0.000000  0.000000
1 -0.027197  0.000000  0.000000
2  1.473916  0.000000 -0.145646
3 -2.633861  0.000000  0.983841
4  0.322159  1.213468  1.272203
5 -0.152426 -0.642216  0.658181
6 -0.271299  1.226415  1.126141

In [20]:
# Calling fillna with a dict, you can use different value for each column:
df.fillna({1:0.5,2:0})

          0         1         2
0  2.091758  0.500000  0.000000
1 -0.027197  0.500000  0.000000
2  1.473916  0.500000 -0.145646
3 -2.633861  0.500000  0.983841
4  0.322159  1.213468  1.272203
5 -0.152426 -0.642216  0.658181
6 -0.271299  1.226415  1.126141

In [21]:
# fillna returns a new object, but you can modify the existing object in-place:
_=df.fillna(0,inplace=True)
df

          0         1         2
0  2.091758  0.000000  0.000000
1 -0.027197  0.000000  0.000000
2  1.473916  0.000000 -0.145646
3 -2.633861  0.000000  0.983841
4  0.322159  1.213468  1.272203
5 -0.152426 -0.642216  0.658181
6 -0.271299  1.226415  1.126141

In [22]:
df=pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA

In [23]:
df

          0         1         2
0 -1.348594  0.356073  1.087416
1 -0.705337  0.447109  2.244486
2  0.803979       NaN -0.262392
3  1.240448       NaN  1.943396
4 -0.344024       NaN       NaN
5 -0.015868       NaN       NaN

In [24]:
df.fillna(method='ffill')

          0         1         2
0 -1.348594  0.356073  1.087416
1 -0.705337  0.447109  2.244486
2  0.803979  0.447109 -0.262392
3  1.240448  0.447109  1.943396
4 -0.344024  0.447109  1.943396
5 -0.015868  0.447109  1.943396

In [25]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -1.348594  0.356073  1.087416
1 -0.705337  0.447109  2.244486
2  0.803979  0.447109 -0.262392
3  1.240448  0.447109  1.943396
4 -0.344024       NaN  1.943396
5 -0.015868       NaN  1.943396

In [26]:
data=pd.Series([1.,NA,3.5,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

### Removing Duplicates

In [27]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [28]:
# The DataFrame method duplicated returns whether each row is a duplicate(has been observed in a previous row) or not:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [29]:
# Relatedly, drop_duplicates returns a DataFrame where the duplicated array is False :
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [30]:
data['v1']=range(7)

In [31]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [32]:
# duplicated and drop_duplicates by default keep the first observed value combination. Passing keep='last' will return the last one:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming data using a function or mapping